Assignment_1/FIO/q6/output_q6.txt
read_4k: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
read_1k: (g=1): rw=read, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=psync, iodepth=1
fio-3.28
Starting 2 processes
read_4k: Laying out IO file (1 file / 64MiB)

read_4k: (groupid=0, jobs=1): err= 0: pid=306323: Fri Apr 11 17:23:18 2025
  read: IOPS=58.1k, BW=227MiB/s (238MB/s)(64.0MiB/282msec)
    clat (usec): min=13, max=129, avg=16.76, stdev= 4.86
     lat (usec): min=13, max=129, avg=16.80, stdev= 4.86
    clat percentiles (usec):
     |  1.00th=[   15],  5.00th=[   15], 10.00th=[   15], 20.00th=[   15],
     | 30.00th=[   15], 40.00th=[   15], 50.00th=[   16], 60.00th=[   17],
     | 70.00th=[   17], 80.00th=[   18], 90.00th=[   19], 95.00th=[   23],
     | 99.00th=[   38], 99.50th=[   46], 99.90th=[   74], 99.95th=[   90],
     | 99.99th=[  124]
  lat (usec)   : 20=91.83%, 50=7.78%, 100=0.37%, 250=0.02%
  cpu          : usr=5.69%, sys=28.83%, ctx=16381, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read_1k: (groupid=1, jobs=1): err= 0: pid=306324: Fri Apr 11 17:23:18 2025
  read: IOPS=59.7k, BW=58.3MiB/s (61.2MB/s)(64.0MiB/1097msec)
    clat (usec): min=11, max=1112, avg=16.29, stdev=11.17
     lat (usec): min=11, max=1112, avg=16.34, stdev=11.18
    clat percentiles (usec):
     |  1.00th=[   14],  5.00th=[   14], 10.00th=[   14], 20.00th=[   14],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   16], 60.00th=[   16],
     | 70.00th=[   17], 80.00th=[   17], 90.00th=[   21], 95.00th=[   23],
     | 99.00th=[   35], 99.50th=[   45], 99.90th=[   73], 99.95th=[   88],
     | 99.99th=[  750]
   bw (  KiB/s): min=60126, max=60370, per=100.00%, avg=60248.00, stdev=172.53, samples=2
   iops        : min=60126, max=60370, avg=60248.00, stdev=172.53, samples=2
  lat (usec)   : 20=88.39%, 50=11.26%, 100=0.31%, 250=0.03%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=7.39%, sys=30.75%, ctx=65528, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=227MiB/s (238MB/s), 227MiB/s-227MiB/s (238MB/s-238MB/s), io=64.0MiB (67.1MB), run=282-282msec

Run status group 1 (all jobs):
   READ: bw=58.3MiB/s (61.2MB/s), 58.3MiB/s-58.3MiB/s (61.2MB/s-61.2MB/s), io=64.0MiB (67.1MB), run=1097-1097msec

Disk stats (read/write):
  nvme0n1: ios=77791/29, merge=0/19, ticks=913/17, in_queue=938, util=56.52%